; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v7)
		(pred_1 ?v4)
		(pred_2 ?v8)
		(pred_4 ?v8)
		(pred_5 ?v4 ?v8)
		(pred_6)
		(pred_3 ?v4))

   (:action op_2
       :parameters  (?v6 ?v1)
       :precondition (and (not-eq ?v6 ?v1) 
                          (pred_2 ?v6) (pred_2 ?v1) (pred_4 ?v6))
       :effect (and  (pred_4 ?v1)
		     (not (pred_4 ?v6))))


   (:action op_1
       :parameters (?v3 ?v5)
       :precondition  (and  (pred_1 ?v3) (pred_2 ?v5)
			    (pred_5 ?v3 ?v5) (pred_4 ?v5) (pred_6))
       :effect (and (pred_3 ?v3)
		    (not (pred_5 ?v3 ?v5)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v3  ?v5)
       :precondition  (and  (pred_1 ?v3) (pred_2 ?v5)
			    (pred_3 ?v3) (pred_4 ?v5))
       :effect (and (pred_5 ?v3 ?v5)
		    (pred_6)
		    (not (pred_3 ?v3)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_03 obj_08 obj_06 obj_01 obj_05 
          obj_07 obj_04 obj_02 
)
(:init
(pred_2 obj_03)
(pred_2 obj_08)
(pred_2 obj_06)
(pred_2 obj_01)
(pred_2 obj_05)
(pred_1 obj_07)
(pred_1 obj_04)
(pred_1 obj_02)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_6)
(pred_5 obj_07 obj_08)
(pred_5 obj_04 obj_03)
(pred_5 obj_02 obj_06)
(pred_4 obj_08)
)
(:goal
(and
(pred_5 obj_07 obj_05)
(pred_5 obj_04 obj_05)
(pred_5 obj_02 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_07 obj_05) (pred_4 obj_03))
    (sometime-before  (pred_5 obj_04 obj_05) (pred_4 obj_06))
  )
)
)

; plan
1. (op_1 obj_07 obj_08)
   deleted: (pred_5 obj_07 obj_08) (pred_6)
   added: (pred_3 obj_07)
   goals met: 1 of 3
2. (op_2 obj_08 obj_06)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_06)
   goals met: 1 of 3
3. (op_3 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_5 obj_07 obj_06) (pred_6)
   goals met: 1 of 3
4. (op_2 obj_06 obj_03)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_03)
   goals met: 1 of 3
5. (op_1 obj_04 obj_03)
   deleted: (pred_5 obj_04 obj_03) (pred_6)
   added: (pred_3 obj_04)
   goals met: 1 of 3
6. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 1 of 3
7. (op_3 obj_04 obj_05)
   deleted: (pred_3 obj_04)
   added: (pred_5 obj_04 obj_05) (pred_6)
   goals met: 2 of 3
8. (op_2 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_06)
   goals met: 2 of 3
9. (op_1 obj_07 obj_06)
   deleted: (pred_5 obj_07 obj_06) (pred_6)
   added: (pred_3 obj_07)
   goals met: 2 of 3
10. (op_2 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_05)
   goals met: 2 of 3
11. (op_3 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_5 obj_07 obj_05) (pred_6)
   goals met: 3 of 3
